## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # helm_release.argocd will be created
+   resource "helm_release" "argocd" {
+       atomic                     = false
+       chart                      = "argo-cd"
+       cleanup_on_fail            = true
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = true
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "argocd"
+       namespace                  = "argocd"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://argoproj.github.io/argo-helm"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       values                     = [
+           (sensitive),
        ]
+       verify                     = false
+       version                    = "5.3.0"
+       wait                       = true
+       wait_for_jobs              = false

+       set {
+           name  = "configs.secret.argocdServerAdminPasswordMtime"
+           value = (known after apply)
        }
+       set {
+           name  = "server.extraArgs"
+           value = "{--insecure}"
        }

+       set_sensitive {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # kubernetes_manifest.argocd-gateway will be created
+   resource "kubernetes_manifest" "argocd-gateway" {
+       manifest = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "Gateway"
+           metadata   = {
+               name      = "argocd"
+               namespace = "argocd"
            }
+           spec       = {
+               selector = {
+                   istio = "ingressgateway"
                }
+               servers  = [
+                   {
+                       hosts = [
+                           "argocd.wayofthesys.org",
                        ]
+                       port  = {
+                           name     = "http"
+                           number   = 80
+                           protocol = "HTTP"
                        }
+                       tls   = {
+                           httpsRedirect = false
                        }
                    },
+                   {
+                       hosts = [
+                           "argocd.wayofthesys.org",
                        ]
+                       port  = {
+                           name     = "https"
+                           number   = 443
+                           protocol = "HTTPS"
                        }
+                       tls   = {
+                           credentialName    = "wayofthesys-org-tls"
+                           mode              = "SIMPLE"
+                           privateKey        = "/etc/istio/ingressgateway-certs/tls.key"
+                           serverCertificate = "/etc/istio/ingressgateway-certs/tls.crt"
                        }
                    },
                ]
            }
        }
+       object   = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "Gateway"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "argocd"
+               namespace                  = "argocd"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               selector = {
+                   "istio" = "ingressgateway"
                }
+               servers  = [
+                   {
+                       bind            = (known after apply)
+                       defaultEndpoint = (known after apply)
+                       hosts           = [
+                           "argocd.wayofthesys.org",
                        ]
+                       name            = (known after apply)
+                       port            = {
+                           name       = "http"
+                           number     = 80
+                           protocol   = "HTTP"
+                           targetPort = (known after apply)
                        }
+                       tls             = {
+                           caCertificates        = (known after apply)
+                           cipherSuites          = (known after apply)
+                           credentialName        = (known after apply)
+                           httpsRedirect         = false
+                           maxProtocolVersion    = (known after apply)
+                           minProtocolVersion    = (known after apply)
+                           mode                  = (known after apply)
+                           privateKey            = (known after apply)
+                           serverCertificate     = (known after apply)
+                           subjectAltNames       = (known after apply)
+                           verifyCertificateHash = (known after apply)
+                           verifyCertificateSpki = (known after apply)
                        }
                    },
+                   {
+                       bind            = (known after apply)
+                       defaultEndpoint = (known after apply)
+                       hosts           = [
+                           "argocd.wayofthesys.org",
                        ]
+                       name            = (known after apply)
+                       port            = {
+                           name       = "https"
+                           number     = 443
+                           protocol   = "HTTPS"
+                           targetPort = (known after apply)
                        }
+                       tls             = {
+                           caCertificates        = (known after apply)
+                           cipherSuites          = (known after apply)
+                           credentialName        = "wayofthesys-org-tls"
+                           httpsRedirect         = (known after apply)
+                           maxProtocolVersion    = (known after apply)
+                           minProtocolVersion    = (known after apply)
+                           mode                  = "SIMPLE"
+                           privateKey            = "/etc/istio/ingressgateway-certs/tls.key"
+                           serverCertificate     = "/etc/istio/ingressgateway-certs/tls.crt"
+                           subjectAltNames       = (known after apply)
+                           verifyCertificateHash = (known after apply)
+                           verifyCertificateSpki = (known after apply)
                        }
                    },
                ]
            }
        }
    }

  # kubernetes_manifest.certificate_argo_argo will be created
+   resource "kubernetes_manifest" "certificate_argo_argo" {
+       manifest = {
+           apiVersion = "cert-manager.io/v1"
+           kind       = "Certificate"
+           metadata   = {
+               name      = "argocd-cert"
+               namespace = "argocd"
            }
+           spec       = {
+               commonName = "argocd.wayofthesys.org"
+               dnsNames   = [
+                   "argocd.wayofthesys.org",
                ]
+               issuerRef  = {
+                   kind = "ClusterIssuer"
+                   name = "zerossl"
                }
+               secretName = "wayofthesys-org-tls"
            }
        }
+       object   = {
+           apiVersion = "cert-manager.io/v1"
+           kind       = "Certificate"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "argocd-cert"
+               namespace                  = "argocd"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               additionalOutputFormats = (known after apply)
+               commonName              = "argocd.wayofthesys.org"
+               dnsNames                = [
+                   "argocd.wayofthesys.org",
                ]
+               duration                = (known after apply)
+               emailAddresses          = (known after apply)
+               encodeUsagesInRequest   = (known after apply)
+               ipAddresses             = (known after apply)
+               isCA                    = (known after apply)
+               issuerRef               = {
+                   group = (known after apply)
+                   kind  = "ClusterIssuer"
+                   name  = "zerossl"
                }
+               keystores               = {
+                   jks    = {
+                       create            = (known after apply)
+                       passwordSecretRef = {
+                           key  = (known after apply)
+                           name = (known after apply)
                        }
                    }
+                   pkcs12 = {
+                       create            = (known after apply)
+                       passwordSecretRef = {
+                           key  = (known after apply)
+                           name = (known after apply)
                        }
                    }
                }
+               literalSubject          = (known after apply)
+               privateKey              = {
+                   algorithm      = (known after apply)
+                   encoding       = (known after apply)
+                   rotationPolicy = (known after apply)
+                   size           = (known after apply)
                }
+               renewBefore             = (known after apply)
+               revisionHistoryLimit    = (known after apply)
+               secretName              = "wayofthesys-org-tls"
+               secretTemplate          = {
+                   annotations = (known after apply)
+                   labels      = (known after apply)
                }
+               subject                 = {
+                   countries           = (known after apply)
+                   localities          = (known after apply)
+                   organizationalUnits = (known after apply)
+                   organizations       = (known after apply)
+                   postalCodes         = (known after apply)
+                   provinces           = (known after apply)
+                   serialNumber        = (known after apply)
+                   streetAddresses     = (known after apply)
                }
+               uris                    = (known after apply)
+               usages                  = (known after apply)
            }
        }
    }

  # kubernetes_manifest.virtualservice_resource will be created
+   resource "kubernetes_manifest" "virtualservice_resource" {
+       manifest = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "VirtualService"
+           metadata   = {
+               name      = "argocd"
+               namespace = "argocd"
            }
+           spec       = {
+               gateways = [
+                   "argocd",
                ]
+               hosts    = [
+                   "argocd.wayofthesys.org",
                ]
+               http     = [
+                   {
+                       match = [
+                           {
+                               uri = {
+                                   prefix = "/"
                                }
                            },
                        ]
+                       route = [
+                           {
+                               destination = {
+                                   host = "argocd-server"
+                                   port = {
+                                       number = 80
                                    }
                                }
                            },
                        ]
                    },
                ]
            }
        }
+       object   = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "VirtualService"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "argocd"
+               namespace                  = "argocd"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               exportTo = (known after apply)
+               gateways = [
+                   "argocd",
                ]
+               hosts    = [
+                   "argocd.wayofthesys.org",
                ]
+               http     = [
+                   {
+                       corsPolicy       = {
+                           allowCredentials = (known after apply)
+                           allowHeaders     = (known after apply)
+                           allowMethods     = (known after apply)
+                           allowOrigin      = (known after apply)
+                           allowOrigins     = (known after apply)
+                           exposeHeaders    = (known after apply)
+                           maxAge           = (known after apply)
                        }
+                       delegate         = {
+                           name      = (known after apply)
+                           namespace = (known after apply)
                        }
+                       directResponse   = {
+                           body   = {
+                               bytes  = (known after apply)
+                               string = (known after apply)
                            }
+                           status = (known after apply)
                        }
+                       fault            = {
+                           abort = {
+                               grpcStatus = (known after apply)
+                               http2Error = (known after apply)
+                               httpStatus = (known after apply)
+                               percentage = {
+                                   value = (known after apply)
                                }
                            }
+                           delay = {
+                               exponentialDelay = (known after apply)
+                               fixedDelay       = (known after apply)
+                               percent          = (known after apply)
+                               percentage       = {
+                                   value = (known after apply)
                                }
                            }
                        }
+                       headers          = {
+                           request  = {
+                               add    = (known after apply)
+                               remove = (known after apply)
+                               set    = (known after apply)
                            }
+                           response = {
+                               add    = (known after apply)
+                               remove = (known after apply)
+                               set    = (known after apply)
                            }
                        }
+                       match            = [
+                           {
+                               authority       = {
+                                   exact  = (known after apply)
+                                   prefix = (known after apply)
+                                   regex  = (known after apply)
                                }
+                               gateways        = (known after apply)
+                               headers         = (known after apply)
+                               ignoreUriCase   = (known after apply)
+                               method          = {
+                                   exact  = (known after apply)
+                                   prefix = (known after apply)
+                                   regex  = (known after apply)
                                }
+                               name            = (known after apply)
+                               port            = (known after apply)
+                               queryParams     = (known after apply)
+                               scheme          = {
+                                   exact  = (known after apply)
+                                   prefix = (known after apply)
+                                   regex  = (known after apply)
                                }
+                               sourceLabels    = (known after apply)
+                               sourceNamespace = (known after apply)
+                               statPrefix      = (known after apply)
+                               uri             = {
+                                   exact  = (known after apply)
+                                   prefix = "/"
+                                   regex  = (known after apply)
                                }
+                               withoutHeaders  = (known after apply)
                            },
                        ]
+                       mirror           = {
+                           host   = (known after apply)
+                           port   = {
+                               number = (known after apply)
                            }
+                           subset = (known after apply)
                        }
+                       mirrorPercent    = (known after apply)
+                       mirrorPercentage = {
+                           value = (known after apply)
                        }
+                       mirror_percent   = (known after apply)
+                       name             = (known after apply)
+                       redirect         = {
+                           authority    = (known after apply)
+                           derivePort   = (known after apply)
+                           port         = (known after apply)
+                           redirectCode = (known after apply)
+                           scheme       = (known after apply)
+                           uri          = (known after apply)
                        }
+                       retries          = {
+                           attempts              = (known after apply)
+                           perTryTimeout         = (known after apply)
+                           retryOn               = (known after apply)
+                           retryRemoteLocalities = (known after apply)
                        }
+                       rewrite          = {
+                           authority = (known after apply)
+                           uri       = (known after apply)
                        }
+                       route            = [
+                           {
+                               destination = {
+                                   host   = "argocd-server"
+                                   port   = {
+                                       number = 80
                                    }
+                                   subset = (known after apply)
                                }
+                               headers     = {
+                                   request  = {
+                                       add    = (known after apply)
+                                       remove = (known after apply)
+                                       set    = (known after apply)
                                    }
+                                   response = {
+                                       add    = (known after apply)
+                                       remove = (known after apply)
+                                       set    = (known after apply)
                                    }
                                }
+                               weight      = (known after apply)
                            },
                        ]
+                       timeout          = (known after apply)
                    },
                ]
+               tcp      = (known after apply)
+               tls      = (known after apply)
            }
        }
    }

  # kubernetes_namespace.argocd will be created
+   resource "kubernetes_namespace" "argocd" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "istio-injection" = "enabled"
            }
+           name             = "argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
